sistema_ingressos/app/controllers/addresses_controller.rb

SELECT "cities"."id" FROM "cities"
INSERT INTO "addresses" ("street", "neighborhood", "number", "created_at", "updated_at", "city_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["street", "rua alex dos anjos"], ["neighborhood", "Asa norte"], ["number", 50], ["created_at", "2019-06-11 20:08:18.643032"], ["updated_at", "2019-06-11 20:08:18.643032"], ["city_id", 2]]
---
  def create
    @address = Address.new(address_params)
    if user_signed_in?
      @address.city_id = City.ids.sample
    end
    respond_to do |format|
      if @address.save

UPDATE "addresses" SET "street" = $1, "neighborhood" = $2, "number" = $3, "updated_at" = $4 WHERE "addresses"."id" = $5  [["street", "Rua do Toddy"], ["neighborhood", "Quebrada do toddynho"], ["number", 20], ["updated_at", "2019-06-14 02:06:56.308769"], ["id", 102]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)

DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 1]]
---
  def destroy
    @address.destroy