sistema_ingressos/app/controllers/age_groups_controller.rb

SELECT "age_groups".* FROM "age_groups"
---
  def index
    @age_groups = AgeGroup.all

INSERT INTO "age_groups" ("age", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["age", 18], ["created_at", "2019-06-11 16:44:57.407985"], ["updated_at", "2019-06-11 16:44:57.407985"]]
---
  def create
    @age_group = AgeGroup.new(age_group_params)

    respond_to do |format|
      if @age_group.save

UPDATE "age_groups" SET "age" = $1, "updated_at" = $2 WHERE "age_groups"."id" = $3  [["age", 30], ["updated_at", "2019-06-14 02:23:04.735484"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @age_group.update(age_group_params)

DELETE FROM "age_groups" WHERE "age_groups"."id" = $1  [["id", 1]]
---
  def destroy
    @age_group.destroy

SELECT  "age_groups".* FROM "age_groups" WHERE "age_groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_age_group
      @age_group = AgeGroup.find(params[:id])