sistema_ingressos/app/controllers/buy_tickets_controller.rb

SELECT "buy_tickets".* FROM "buy_tickets"
---
  def index
    @buy_tickets = BuyTicket.all

SELECT "tickets"."id" FROM "tickets"
INSERT INTO "buy_tickets" ("bought_moment", "value", "created_at", "updated_at", "ticket_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bought_moment", "2019-06-11 20:20:00"], ["value", 20.0], ["created_at", "2019-06-11 20:21:08.140228"], ["updated_at", "2019-06-11 20:21:08.140228"], ["ticket_id", 1], ["user_id", 1]]
---
  def create
    @buy_ticket = BuyTicket.new(buy_ticket_params)
    if user_signed_in?
      @buy_ticket.user_id = current_user.id
      @buy_ticket.ticket_id = Ticket.ids.sample
    end
    respond_to do |format|
      if @buy_ticket.save

UPDATE "buy_tickets" SET "bought_moment" = $1, "value" = $2, "updated_at" = $3 WHERE "buy_tickets"."id" = $4  [["bought_moment", "2021-10-10 00:00:00"], ["value", 20.45], ["updated_at", "2019-06-14 02:33:41.969570"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @buy_ticket.update(buy_ticket_params)

DELETE FROM "buy_tickets" WHERE "buy_tickets"."id" = $1  [["id", 30]]
---
  def destroy
    @buy_ticket.destroy

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "buy_tickets".* FROM "buy_tickets" WHERE "buy_tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_buy_ticket
      @buy_ticket = BuyTicket.find(params[:id])