sistema_ingressos/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    if user_signed_in?
      @event.user_id = current_user.id
      @event.age_group_id = AgeGroup.ids.sample
      @event.event_class_id = EventClass.ids.sample
    end
    respond_to do |format|
      if @event.save
---
SELECT "age_groups"."id" FROM "age_groups"
SELECT "event_classes"."id" FROM "event_classes"
INSERT INTO "events" ("name", "begin_date", "end_date", "created_at", "updated_at", "user_id", "event_class_id", "age_group_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "name" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["name", "Finalmente carai"], ["updated_at", "2019-06-11 18:54:54.687729"], ["id", 1]]