sistema_ingressos/app/controllers/event_centers_controller.rb

  def index
    @event_centers = EventCenter.all
---
SELECT "event_centers".* FROM "event_centers"

  def create
    @event_center = EventCenter.new(event_center_params)
    if user_signed_in?
      @event_center.address_id = Address.ids.sample
    end
    respond_to do |format|
      if @event_center.save
---
SELECT "addresses"."id" FROM "addresses"
INSERT INTO "event_centers" ("name", "created_at", "updated_at", "address_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Somewhere"], ["created_at", "2019-06-11 20:14:39.806009"], ["updated_at", "2019-06-11 20:14:39.806009"], ["address_id", 1]]

    def set_event_center
      @event_center = EventCenter.find(params[:id])
---
SELECT  "event_centers".* FROM "event_centers" WHERE "event_centers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]