sistema_ingressos/app/controllers/payment_methods_controller.rb

  def index
    @payment_methods = PaymentMethod.all
---
SELECT "payment_methods".* FROM "payment_methods"

  def create
    @payment_method = PaymentMethod.new(payment_method_params)

    respond_to do |format|
      if @payment_method.save
---
INSERT INTO "payment_methods" ("method", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["method", "Cartão"], ["created_at", "2019-06-11 20:21:38.306880"], ["updated_at", "2019-06-11 20:21:38.306880"]]

    def set_payment_method
      @payment_method = PaymentMethod.find(params[:id])
---
SELECT  "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]