sistema_ingressos/app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments"
---
  def index
    @payments = Payment.all

SELECT "payment_methods"."id" FROM "payment_methods"
INSERT INTO "payments" ("payment_moment", "paid_amount", "change_money", "created_at", "updated_at", "payment_method_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @payment = Payment.new(payment_params)
    if user_signed_in?
      @payment.payment_method_id = PaymentMethod.ids.sample
    end
    respond_to do |format|
      if @payment.save

SELECT  "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_payment
      @payment = Payment.find(params[:id])