sistema_ingressos/app/controllers/presentation_rooms_controller.rb

  def index
    @presentation_rooms = PresentationRoom.all
---
SELECT "presentation_rooms".* FROM "presentation_rooms"

  def create
    @presentation_room = PresentationRoom.new(presentation_room_params)
    if user_signed_in?
      @presentation_room.room_id = Room.ids.sample
      @presentation_room.presentation_id = Presentation.ids.sample
    end
    respond_to do |format|
      if @presentation_room.save
---
SELECT "rooms"."id" FROM "rooms"
SELECT "presentations"."id" FROM "presentations"
INSERT INTO "presentation_rooms" ("created_at", "updated_at", "presentation_id", "room_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-06-11 20:18:29.956382"], ["updated_at", "2019-06-11 20:18:29.956382"], ["presentation_id", 1], ["room_id", 2]]

    def set_presentation_room
      @presentation_room = PresentationRoom.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "presentation_rooms".* FROM "presentation_rooms" WHERE "presentation_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]