sistema_ingressos/app/controllers/presentations_controller.rb

  def index
    @presentations = Presentation.all
---
SELECT "presentations".* FROM "presentations"

  def create
    @presentation = Presentation.new(presentation_params)
    if user_signed_in?
      @presentation.event_id = Event.ids.sample
    end
    respond_to do |format|

      if @presentation.save
---
SELECT "events"."id" FROM "events"
INSERT INTO "presentations" ("date", "hour", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2019-06-11"], ["hour", "19:59:00"], ["created_at", "2019-06-11 20:04:45.110788"], ["updated_at", "2019-06-11 20:04:45.110788"], ["event_id", 2]]

    def set_presentation
      @presentation = Presentation.find(params[:id])
---
SELECT  "presentations".* FROM "presentations" WHERE "presentations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]