sistema_ingressos/app/controllers/rooms_controller.rb

SELECT "event_centers"."id" FROM "event_centers"
INSERT INTO "rooms" ("number", "crowded", "created_at", "updated_at", "event_center_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 11], ["crowded", false], ["created_at", "2019-06-11 20:16:01.453672"], ["updated_at", "2019-06-11 20:16:01.453672"], ["event_center_id", 2]]
---
  def create
    @room = Room.new(room_params)
    if user_signed_in?
      @room.event_center_id = EventCenter.ids.sample
    end
    respond_to do |format|
      if @room.save