sistema_ingressos/app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)
    if user_signed_in?
      @ticket.user_id = current_user.id
      @ticket.ticket_type_id = TicketType.ids.sample
      @ticket.presentation_room_id = PresentationRoom.ids.sample
    end
    respond_to do |format|
      if @ticket.save
---
SELECT "ticket_types"."id" FROM "ticket_types"
SELECT "presentation_rooms"."id" FROM "presentation_rooms"
INSERT INTO "tickets" ("created_at", "updated_at", "ticket_type_id", "presentation_room_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-06-11 20:20:39.428169"], ["updated_at", "2019-06-11 20:20:39.428169"], ["ticket_type_id", 2], ["presentation_room_id", 2], ["user_id", 1]]