sistema_ingressos/app/controllers/ticket_types_controller.rb

  def index
    @ticket_types = TicketType.all
---
SELECT "ticket_types".* FROM "ticket_types"

  def create
    @ticket_type = TicketType.new(ticket_type_params)

    respond_to do |format|
      if @ticket_type.save
---
INSERT INTO "ticket_types" ("description", "base_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Nao sei mano"], ["base_price", 20.0], ["created_at", "2019-06-11 20:11:38.183589"], ["updated_at", "2019-06-11 20:11:38.183589"]]

    def set_ticket_type
      @ticket_type = TicketType.find(params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]