sistema_ingressos/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "cpf", "birth", "email", "login", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "cpf" = $1, "email" = $2, "login" = $3, "password" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["cpf", "03015079107"], ["email", "rofl@rofl.com"], ["login", "roflzaum"], ["password", "rofl"], ["updated_at", "2019-06-11 12:30:27.925452"], ["id", 1]]